import 'recipe_structure.dart';

final List<RecipeStructure> recipeList = [
  RecipeStructure(
      ename: 'Veg Sandwich',
      name: 'भेज स्यान्डविच',
      image:
          'https://images.unsplash.com/photo-1539252554453-80ab65ce3586?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=634&q=80',
      veg: true,
      popular: true,
      mainItem: MainItem.vegetable,
      description: 'descritption here',
      ingredients: {
        'Bread': 'ब्रेड - 2',
        'lettuce': 'सलाद- २/३ पातहरू',
        'cheese': 'चीज - १ टुक्रा',
        'tomato': 'टमाटर - १ गोल घेरामा काटियो',
        'green chilli ': 'हरियो मिर्च-गोल घेरामा काटिएको ',
        'onion': 'प्याज-केही गोल सर्कलमा काटिएको ',
        'Mayonnaise': 'मेयोनेज (वैकल्पिक)',
      },
      stepsForCooking: [
        'ब्रेडको  खैरो पक्ष काट्नुहोस्',
        'ब्रेड एक मिनेट को लागी टोस्ट गर्नुहोस',
        'ब्रेड को एक तिर मेयोनेस फैलाउनुहोस',
        'ब्रेड्मा पनीर, सलाद, प्याज, टमाटर र हरियो घण्टी मिर्च राख्नुहोस्',
        'पहिलो ब्रेड्को  माथिको अर्को ब्रेड राख्नुहोस्',
        'स्यान्डविच विकर्ण गर्नको लागि दुई टुक्रा मा काट्नुहोस्',
        'Veggie sandwich is ready to serve!',
        'चिकन स्यान्डविच बनाउनका लागि तपाईले कुखुरा प्याटीहरू थप गर्नु पर्छ (चिकन किमा बर्गर)',
      ]),
  RecipeStructure(
      name: 'खुर्सानी तिल को अचार ',
      ename: 'chilly pickel',
      ingredients: {},
      veg: true,
      image:
          'https://firebasestorage.googleapis.com/v0/b/food-recipes-in-nepali.appspot.com/o/Chilly%20Pickel.jpg?alt=media&token=70a1fa93-c2c3-497e-8900-a2d16b5d9351',
      stepsForCooking: [
        'हरियो खोर्सोलाई आधा भागमा काट्नुहोस् (सिधा होइन)',
        'स्टोभ खोल्नुहोस् र प्यान तताउनुहोस्',
        'यसमा तेल थप्नुहोस्, जब तेल तातो छ भने मेथीको दाना थप्नुहोस्',
        'जब यो सुनहरी खैरोमा परिवर्तन हुन्छ हरियो मिर्च जोड्नुहोस्',
        'जब ती गोल्डन खैरो बन्छन् भने तिलको पाउडर र नुन थप्नुहोस्',
        'पानी थप्नुहोस्, र सबै पानी सुक्खा सम्म पकाउनुहोस्',
        'ग्यास बन्द गर्नुहोस् र कागती जुस जोड्नुहोस् र राम्रोसँग मिक्स गर्नुहोस्',
        'तपाईंको तिल र खोर्सानीको चटनी सेवा गर्नको लागि तयार छ',
        'यो चटनी चामल, रोटी, वा च्युराको साथ उत्तम हो!',
      ]),
  RecipeStructure(
    name: 'भारतीय चिकन मद्रास करी',
    ename: 'Indian Chicken Madras Curry Recipe',
    veg: false,
    mainItem: MainItem.meat,
    popular: true,
    image:
        'https://firebasestorage.googleapis.com/v0/b/food-recipes-in-nepali.appspot.com/o/Indian%20Chicken%20Madras%20Curry%20Recipe.jpg?alt=media&token=a4e43374-9eba-4247-b9fb-bffb0c7bd2ee',
    ingredients: {
      'chicken': 'छालाविहीन,हड्डी रहित कुखुराको मासु काटिन्छ र सुक्खा राखिन्छ',
      'onion': '१ प्याज',
      'Garlic': '८ लहसुन ',
      'Ginger': '१  अदुवा',
      'jalapeno': '१  jalapeno',
      'Vegetable oil': '१ चम्मच वनस्पति तेल',
      'Hot spice': '१ चम्मच गरम मसला',
      'chilli powder': '२ चम्मच खुर्सानी ',
      'Turmeric': '१/२ चम्मच हल्दी',
      'salt': '१ चम्मच नुन',
      'tomato': '२ कप पिसेको टमाटर ',
    },
    stepsForCooking: [
      'प्याज, लसुन, अदुवा, र jalapeno एक मिनी फूड प्रोसेसर वा ब्लेन्डरमा हाल्नुहोस । मिश्रण शुद्ध नभएसम्म ब्लेन्ड गर्नुहोस्।',
      'मसलालाई एउटा सानो कटोरामा मिलाउनुहोस् र अलग राख्नुहोस्।',
      'सानो  सेटिंगमा  भाँडामा तेल तताउनुहोस्। प्याजको मिश्रण थप्नुहोस् र  ३- ४  मिनेटसम्म धेरै जसो पानीको बाफ  नभएसम्म पकाउनुहोस्',
      'प्याजको मिश्रणमा मसला र नुन थप्नुहोस् र मसलाहरू सुगन्धित नभएसम्म १ - २ मिनेटसम्म पकाउनुहोस्।',
      'कुखुराको मासु  हाल्नुहोस  र सबै पक्षहरू ब्राउन नभएसम्म लगभग ३-४  मिनेटसम्म पकाउनुहोस्।',
      'पिसेको  टमाटर थप्नुहोस् र चलाउनुहोस ',
      'तत्काल भाँडोमा ढकनी राख्नुहोस् र  ४ मिनेटको लागि प्रेसर कुक हुन दिनुस । ४ मिनेट पछि ढकनी खोल्नुहोस , एक चोटि स्टीम सकिए पछि, तत्काल भाँडो खोल्नुहोस्। यदि sauce धेरै पानी भएको छ भने, मासु  हटाउनुहोस् र गाढा नहुञ्जेल सानो  सेटिंगमा sauce पकाउनुहोस्।',
      'खानको लागि तयार भयो ',
    ],
  ),
  RecipeStructure(
      name: 'गाजर को हलुवा',
      ename: 'Carrot Halva',
      veg: true,
      mainItem: MainItem.vegetable,
      popular: true,
      image:
          'https://firebasestorage.googleapis.com/v0/b/food-recipes-in-nepali.appspot.com/o/Carrot%20Halva.jpg?alt=media&token=24a686dd-d863-4533-b977-d9e7cee66bfc',
      description:
          'गाजरमा आधारित मीठो मिठाई पुडिंग भारतीय उपमहाद्वीपबाट आएको हो । यो पानी, दूध र चिनी को एक निश्चित मात्रा युक्त भाँडो मा धुलिएको  गाजर राखेर र त्यसपछि पकाउँदा लगातार चलाएर बनाइएको हो',
      ingredients: {
        'Carrots': '२ कप टुक्राइयेको गाजर',
        'Milk': '२ कप दुध',
        'sugar': 'चिनी १/४ कप',
        'Cardamom powder': 'इलायची पाउडर १/२ चम्माच',
        'cashew': 'काटिएको काजु-६',
        'Ghee': 'घीउ- १/२ चम्मच',
      },
      stepsForCooking: [
        'दूध उमाल्नुहोस्',
        'अर्को प्यानमा घी पगाल्नुहोस्',
        'टुक्राइयेको गाजर थप्नुहोस् र करीव सात मिनेट को लागी फ्राई गर्नुहोस्',
        'जब गाजर अलि सुनौलो खैरो परिणत हुन्छ दूध हाल्नुहोस',
        'सबै दूध सुक्खा नहुने सम्म यो मिश्रण पकाउनुहोस्',
        'चिनी र इलायची पाउडर राख्नुहोस् र राम्रोसँग मिक्स गर्नुहोस्',
        'चार मिनेट को लागी पकाउनुहोस',
        'काजूको साथ गार्निश गर्नुहोस्',
        'स्टोभ बन्द गर्नुहोस् गजर हालुवा खानको लागि तयार छ',
        'तपाईं यो हलवालाई एक ग्रीस प्लेटमा फ्रिज गर्न सक्नुहुन्छ',
        'बर्फीको आकारमा यसलाई काट्नुहोस् गजर बर्फी तयार छ',
      ]),
  RecipeStructure(
      name: 'चिकन दम बिरयानी',
      ename: 'Chicken Dum Biryani',
      popular: true,
      image:
          'https://firebasestorage.googleapis.com/v0/b/food-recipes-in-nepali.appspot.com/o/Chicken%20Dum%20Biryani.jpg?alt=media&token=751d7e89-1efa-45b9-a0a9-8b73fb65d005',
      description:
          'सामान्य चिकन बिरयानीमा मासुलाई छुट्टिन्छ र थपिएको हुन्छ, जबकि दम बिरयानीमा सम्पूर्ण चावल, मासु, आलु वाफ र दबाबले पकाइन्छ। यसैले फ्राइड कुखुरा बिरयानी अधिक तेल र मसलादार हुनेछ, र दम बिरियानी अधिक सुगन्धित हुनेछ।',
      veg: false,
      mainItem: MainItem.meat,
      ingredients: {
        'Chicken': 'खुखुराको मासु (लेग)-५०० ग्राम',
        'chilli': '१ चम्मच रातो खोर्सानी पाउडर',
        'ginger': '२ चम्मच अदुवा-लसुन पेस्ट',
        'curd': '१/२ कप दही',
        'turmeric': '१/२ चम्मच हल्दी पाउडर',
        'green parsley': '१ चम्मच धनिया पाउडर',
        'spices': '१ चम्मच गरम मसला पाउडर',
        'saffron': 'एक चुटकी केसर',
        'milk': '1/2 कप दूध',
        'cardamoms': '5 इलाइची',
        'Cinnamon': '१ दाल​चीनी स्टिक ',
        'rice': 'बासमती चावल',
        'Onion': 'प्याज',
      },
      stepsForCooking: [
        'एक कप दुधमा केसर मिलाउनुहोस् र यसलाई छेउमा राख्नुहोस्।',
        'अब चामल तयार गर्नको लागि, केसरलाई खारेज गर्नुहोस् र सामग्रीहरू धोईएको भातमा राख्नुहोस्।',
        'यसलाई १० देखि १5 मिनेट सम्म पकाउनुहोस्।',
        'प्यानमा घी तताउनुहोस् र मरीनेट गरिएको कुखुरा र पकाइएको चामल पनि थप्नुहोस्। केसरको दूध, धनिया, भुटेको प्याज र काटिएको बदाम जोड्नुहोस् र राम्रोसँग मिक्स गर्नुहोस्।',
        'यसलाई कम तातोमा पाक्न दिनुहोस् र २० देखि ३० मिनेटसम्म  छोप्नुहोस्। (पानी सुकाउँदै, कुखुरा र चामल पूर्ण रूपमा पाकुन्जेल सम्म यसलाई छोड्नुहोस ।)',
        'अब यसलाई खोल्नुहोस् र चामल राम्ररी मिलाउनुहोस्। तपाईं यसलाई केही गुलाब पानी थपेर खान सक्नुहुन्छ।',
        'एउटा भाडोमा कुखुराको मासु राखी म्यारिनेट गर्ने मसला राखी २/3 घण्टाको लागि छोड्नुहोस ',
        'NOTE: बिरयानी बनाउने क्रममा, ध्यान दिनुहोस् कि चामल न टुक्रियोस'
      ]),
  RecipeStructure(
      name: 'डुनोट',
      ename: 'Doughnut',
      description:
          'डुनोट खाजा वा नास्ताको लागि राम्रो विकल्प मानिन्छ। पसलमा किनेर खाइने उक्त डुनोटलाई सजिलो तरिकाले घरमै बनाउन सकिन्छ। घरमै डुनोट बनाउनाले आफूले रोजेको तेलमा पकाएर ताजा नै खाना सकिन्छ।',
      image:
          'https://firebasestorage.googleapis.com/v0/b/food-recipes-in-nepali.appspot.com/o/Doughnut.jpg?alt=media&token=9b59e086-7e23-4e01-aecf-b40f692ab642',
      veg: true,
      ingredients: {
        'Flour': 'मैदा',
        'sugar': 'चिनी',
        'Baking soda': 'पीठो फुलाउने सोडा',
      },
      stepsForCooking: [
        'मैदामा सबै कुरा राखेर मुछ्नुहोस्',
        'मैदा मुछ्दा बिस्तारै र राम्रो तरिकाले मुछ्नुपर्छ ।',
        'मुछिसकेपछि वरिपरि तेल लगाएर ढाक्ने र कम्तीमा पनि दुई घण्टा यत्तिकै राख्ने ।',
        'अब त्यो मैदालाई बेल्न सुरु गर्नुपर्छ ।',
        'पीठोको डल्लोलाई लाम्चो आकारमा काट्ने र गिलास वा कचौराले गोलो-गोलो गरेर काट्ने ।',
        'अब ती गोलो भागहरुमा बीचमा कुनै बिर्कोको साहयाताले सानो गोलो बनाउने ।',
        'त्यसलाई एक घण्टा छोपेर राख्ने ।',
        'अब त्यसलाई तेलमा फ्राई गरेपछि डुनोट तयार हुन्छ ।',
      ]),
  RecipeStructure(
      name: 'जेरी',
      ename: 'Jalebi',
      image:
          'https://firebasestorage.googleapis.com/v0/b/food-recipes-in-nepali.appspot.com/o/Jalebi.jpg?alt=media&token=794c38ab-2c89-4bfe-bdde-aa4b42fbf1bf',
      description:
          'यो डीप-फ्राईंग मैदाको पीठो (सादा पीठ वा सबै उद्देश्यको पीठ) बाट  गोलाकार आकारहरूमा बनाईन्छ, जुन चिनी सिरप मा  भिजाइन्छ। ',
      veg: true,
      ingredients: {
        'Sugar': 'चिनी',
        'Baking Soda': 'बेकिंग पाउडर',
        'Turmeric': 'बेसार वा फुड कलर',
        'Curd': 'दही',
      },
      stepsForCooking: [
        'एउटा भाँडोमा पानी राख्नुहोस् र त्यसमा चिनी राखेर उमाल्नुहोस् ।',
        'चिनी पानी बाक्लो हुनेगरि उमाल्नुहोस् ।',
        'अब एउटा भाँडोमा मैदा, बेकिंग पाउडर, दही राख्नुहोस र त्यसमा पानी राखेर मुछ्नुहोस् ।',
        'जेरीमा रंग आओस भन्नका लागि फुड कलर वा थोरै मात्र बेसर राख्नुहोस् ।',
        'कराईमा तेल वा घ्यु बसाल्नुहोस् ।',
        'अब तेलको खाली प्याकेटको बन्द भागतिर प्वाल पार्नुहोस् ।',
        'त्यो कागजमा मुछेको पिठो भर्नुहोस् र सानो प्वाल तिर बाट जेरी बनाउन थाल्नुहोस् ।',
        'जेरी पाकेपछि त्यसलाई चिनी पानीमा डुबाउनुहोस् ।',
      ]),
  RecipeStructure(
      name: 'मुलाको अचार',
      ename: 'Radish Pickle',
      image:
          'https://firebasestorage.googleapis.com/v0/b/food-recipes-in-nepali.appspot.com/o/Radish%20Pickle.jpg?alt=media&token=db3ecf20-f675-4a8f-b19b-096481a7a7c7',
      mainItem: MainItem.vegetable,
      veg: true,
      description:
          'नेपाली भान्सामा अचार महत्वपूर्ण परिकार मानिन्छ । दैनिक जीवनको खानपान लगायत भोज भतेरमा समेत अचारको छुट्टै महत्व हुन्छ । अचारले संगै खाइरहेको परिकारमा नयाँ स्वाद थपिदिन्छ । मासु, तरकारी तथा फलफूलबाट पनि अचार बनाउन सकिन्छ । अचार एउटा ताजा हुन्छ भने अर्को बोतलमा केही समय आगाडी बनाएर राखिएको हुन्छ, जसलाई खाँदेको अचार भनिन्छ ।',
      ingredients: {
        'Radish': 'बोक्रा नखुर्किएको मुला',
        'Turmeric': 'बेसार',
        'Chilli': 'रातो खुर्सानीको धुलो',
        'garlic': 'लसुन',
        'Green chilli': 'हरियो खुर्सानी',
        'cumin': 'जिरा',
        'Muatard': 'तोरी',
      },
      stepsForCooking: [
        'मुलालाई लाम्चो आकारमा काट्नुपर्छ ।',
        'मुला काटेपछि त्यसलाई घाममा सुकाउने ।',
        'मुला माथि खुर्सानी राख्ने र त्यसमा लसुन पनि राखेर सुकाउने ।',
        'त्यसलाई दुई दिनसम्म सुकाउनुपर्छ ।',
        'दुई दिनपछि सुकाएको मुला, खुर्सानी, लसुन निकाल्ने ।',
        'प्यानमा तोरी भुटेर पिस्ने ।',
        'अब जिरा भुट्ने र पिस्ने ।',
        'मुलामा नुन, खुर्सानी, बेसार लगायत सबै मसलाहरु राख्ने ।',
        'अब त्यसमा तेल राख्ने र राम्रोसंग मिक्स गर्ने ।',
        'त्यसपछि एउटा बट्टामा मुलाको अचार राख्ने ।',
        'बट्टालाई घाममा कम्तिमा पनि चार दिन सम्म नचलाई राख्नुपर्छ ।',
      ]),
  RecipeStructure(
      name: 'फलाफेल',
      ename: 'Falafel',
      mainItem: MainItem.vegetable,
      popular: true,
      veg: true,
      description:
          'यदि तपाईं फलाफेललाई माया गर्नुहुन्छ भने, यो प्रयास गर्नै पर्दछ। यो मेरो व्यक्तिगत मनपर्ने falafel नुस्खा वर्षौं को लागी आएको छ, र समयको साथ, हाम्रा हजारौं पाठकहरूले पनि यिनीहरूलाई बनाएका र माया गरेका छन्!',
      image:
          'https://firebasestorage.googleapis.com/v0/b/food-recipes-in-nepali.appspot.com/o/Falafel.jpg?alt=media&token=746baab8-388f-4e64-8a01-80f9fa2692dc',
      ingredients: {
        'Chickpeas': 'चना',
        'Parsley': 'धनिया',
        'Garlic': 'लसुन',
        'Onion': 'प्याज',
        'Flour': 'पीठो',
        'Baking powder': 'बेकिंग पाउडर',
        'seasoning': 'मसाला',
        'Lemon juice': 'कागतीको रस',
      },
      stepsForCooking: [
        ' लगभग तपाईंको सामग्रीहरू पुरी गर्नुहोस्। तपाईं या त यो फूड प्रोसेसर (मेरो सिफारिश), स्ट्यान्ड मिक्सर, वा ब्लेन्डरमा गर्न सक्नुहुन्छ। मिश्रण एउटा राम्रो-अन्न बनावटमा नपुगुञ्जेल पल्स (भद्दा बालुवा जस्ताको प्रकार, आदर्श रूपमा अत्यधिक गिलो होइन)।',
        'मिश्रणलाई एक कचौरामा हस्तान्तरण गर्नुहोस्, कभर गर्नुहोस् र चिसो नभएसम्म केही घण्टाको लागि फ्रिज गर्नुहोस्। (वा तपाइँ यस प्रक्रियालाई छिटो बनाउन तहमा मिश्रण फैलाएर र चिसो नभएसम्म ३०-४५  मिनेटको लागि फ्रिजरमा पप गरेर यस प्रक्रियालाई वेग दिन सक्नुहुन्छ।)',
        'एक मध्यम (२-ठूलो चम्मच) कुकी स्कूप वा एक चम्चाको मिश्रण २ टेबिलस्पून मिश्रणको स्कूप गर्न प्रयोग गर्नुहोस्, र त्यसपछि तपाईंको हातहरू यसलाई बलमा आकार दिनका लागि प्रयोग गर्नुहोस्। बललाई चर्मपत्रले छोपिएको पानामा राख्नुहोस्, त्यसपछि यसलाई तपाईंको हातले हल्का रूपमा सपाट गर्नुहोस् ता कि यो करिब १ / २ इन्च बाक्लो छ। बाँकी आटा मिश्रणको साथ दोहोर्याउनुहोस्।',
        'मध्यम आँचमा तेल तताउनुहोस्। त्यसो भए ध्यानपूर्वक तेलमा ४-५ फलाफेल थप्नुहोस् र ब्राउन र क्रिस्पी नभएसम्म प्रति साइड २-३  मिनेट पकाउनुहोस्। कुनै थप तेल सोख्न कागज-तौंलीले लाइन लगाएको प्लेटमा फालाफेलहरू स्थानान्तरण गर्नुहोस्। बाँकी फलाफेलहरूको साथ यहि प्रक्रिया दोहोराउनुहोस ',
        'फलाफेल खानकोलागि तयार भयो!!',
      ]),
  RecipeStructure(
      name: 'जुजु धौ',
      ename: 'Yogurt King',
      veg: true,
      mainItem: MainItem.milk,
      image:
          'https://firebasestorage.googleapis.com/v0/b/food-recipes-in-nepali.appspot.com/o/Yogurt%20King.jpg?alt=media&token=798ae81f-e312-479d-8068-727422fcdd01',
      description:
          'जुजु धौ प्रसिद्ध नेपाली दही हो, विशेष गरी काठमाडौं उपत्यका (भक्तपुर) भित्र। "धौ" शब्दको अर्थ मीठो दही हो, जुन नेवारहरू नेपालको आदिवासी जनजातिबाट सामान्यतया तयार गरिन्छ।',
      ingredients: {
        'Yogurt': 'दही',
        'Milk': 'दुध',
        'cardamom': 'सुकमेलको धुलो',
      },
      stepsForCooking: [
        'एउटा भाँडोमा दुध तताउने । दुध केहि घट्ने गरि तताइरहनुपर्छ ।',
        'त्यसमा चिनी र सुकमेलको धुलो राखेर केही बेर पकाउने ।',
        'दुध बाक्लो भएपछि भाँडोमा खन्याउने । केही छिन् चिसो हुन दिने।',
        'त्यसपछि त्यसमा साधारण दही राखिदिने र केही छोप्ने ।',
        'अब त्यसलाई ६ घण्टासम्म तातो ठाउँमा राख्ने ।',
      ]),
  RecipeStructure(
      name: 'पनिर',
      ename: 'Cheese',
      mainItem: MainItem.milk,
      description:
          'स्वास्थ्यवधर्क खाद्यपदार्थको रूपमा पनीर वा पनीर बडा महत्वपूर्ण एवं चिसा देशहरूमा बहुप्रचलित खाद्य हो[स्रोत नखुलेको]। जस्तै रोगिहरू, बच्चाहरू एवं बूढहरूको लागि जसलाई मांसुयुक्त भोजन पचाउनमा कठिनाई हुन्छ, तिनीहरू लाई पनीर श्रेष्ठ खाद्य पदार्थ मानिन्छ, किनकी यसमा प्रोटीन, मासुमा जत्ति नै यथेष्ट मात्रामा हुन्छ र अधिक पाचक दशामा रहन्छ। साथ साथै क्यालोरि (calories)को मात्रा मासुमा जति नै हुन्छ।',
      image:
          'https://firebasestorage.googleapis.com/v0/b/food-recipes-in-nepali.appspot.com/o/Cheese.jpg?alt=media&token=01ab80af-01c9-4d89-933f-c32f592ccfe9',
      ingredients: {
        'Milk': 'दुध'
      },
      stepsForCooking: [
        'पनिर बनाउनको लागि एउटा भाँडोमा दुध उमाल्नुपर्छ ।',
        'दुध उम्लिएसकेपछि दुधलाई फटाउनको लागि कागतीको रस राख्नुपर्छ र फेरी उमाल्नुपर्छ ।',
        'फेरी उमाल्दा दुध पूर्ण रुपमा फाट्छ । अब फाटेको दुध अलिकति सेलाएपछि सफा कपडाले छान्नुपर्छ ।',
        'छानिसकेपछी त्यसलाई कपडामा नै राखेर थिच्नुपर्छ र एउटा आकार दिनुपर्छ । र, त्यसपछि केही छिन रेफ्रिज्रेटरमा राख्नुपर्छ ।',
      ]),
  RecipeStructure(
      name: 'म:म  को आचार',
      ename: 'Dumpling sauce',
      veg: true,
      image:
          'https://firebasestorage.googleapis.com/v0/b/food-recipes-in-nepali.appspot.com/o/Dumpling%20Sauce.jpg?alt=media&token=569524a4-f5d5-4b16-aaa7-a5dc7c35978b',
      description:
          'सामान्यतया मोमो आचार टमाटरले बनेको हुन्छ। मोमो तातो खाईन्छ र आचार चिसो राखिन्छ, त्यसकारण संयोजनले खाँदा खाईएको बेला तटस्थ तापमान दिन्छ।',
      ingredients: {
        'Tomatoes': 'टमाटर - २ ठुलो',
        'Sesame seed': 'तिलको दाना - ३ चम्चा',
        'chilies': 'रातो खोर्सानी सुकाइएको ',
        'Garlic': 'लसुन - २ टुक्रा',
        'green parsley': 'धनिया - ४ पातहरू',
        'salt': 'नुन',
      },
      stepsForCooking: [
        'फ्राइ pan पनमा लगभग १ मिनेटको लागि तिलको दाना तताउनुहोस्',
        'एक कचौरामा दुई टमाटर धुनुहोस् र लिनुहोस् (कुनै पानी थपे बिना)र यसलाई माइक्रोवेभमा / स्टोभमा १ मिनेटको लागि राख्नुहोस्।(गोल्भेडा पोल्ने)',
        'स्टोभको माथि रातो खोर्सानीको ६ वटा टुक्राहरू राख्नुहोस् र यसलाई केहि मिनेट को लागी तातो हुन दिनुहोस् । (खुर्सानी पोलर)',
        'तिल लाइ mixture मा पिस्नुहोस, त्यसमा  रातो खोर्सानी, लसुन नुन,धनिया र टमाटर सँगै सँगै मिसाउनुहोस र राम्रो पेस्ट पाउनकोलागि  फेरि पिस्नुहोस ',
        'तपाईंको मोमो को आचार तातो मोमोको साथ स्वाद दिन तयार छ ',
      ]),
  RecipeStructure(
      name: 'मसला चिया',
      ename: 'Masala Chai',
      mainItem: MainItem.milk,
      popular: true,
      veg: true,
      image:
          'https://firebasestorage.googleapis.com/v0/b/food-recipes-in-nepali.appspot.com/o/Masala%20Chai.jpg?alt=media&token=49b80030-d0b4-40bb-8a78-11d12dd30b72',
      description:
          'जे होस्, सामग्रीहरू क्षेत्र अनुसार फरक फरक हुन सक्दछ, "चिया मसाला" मा सामान्यतया कुचिएको अदुवा, कुचिएको अलैंची, काली मिर्च, लन्ग र दालचिनी हुन्छ।',
      ingredients: {
        'cloves': '४-ल्वांग',
        'cardamom': '२-इलायची कोसा',
        'cinnamon': '१-दालचिनी स्टिक, टुक्राइएको',
        'water': '३ कप पानी ',
        'ginger': 'थोरै अधुवा ',
        'Black peppers': 'मरिच',
        'milk': '१-२कप दूध',
        'sugar': '२-चम्मच दानेदार चिनी',
        'tea leaves': '२ चम्मच चियापत्ती'
      },
      stepsForCooking: [
        'मोर्टारमा, लौंगहरू, अलैंची पोडहरू र दालचिनी क्रुश गर्नुहोस्, वा कफि ग्राइन्डर प्रयोग गर्नुहोस्।',
        'पिसेको मसला लाई एउटा सानो भाँडोमा राख्नुहोस। पानी, अदुवा र मरिच हाल्नुहोस र उभाल्नुहोस ',
        'भकभकी उम्लिसकेपछी उतार्नुहोस र ५ मिनेटको लागि छोप्नुहोस ',
        'दुध र चिनी थप्नुहोस र फेरि एकपल्ट उमाल्नुहोस ',
        'भाँडो लाइ एकछिन फेरि उतार्नुहोस र चियापत्ती थप्नुहोस (Decaf is best)',
        'फेरि ३ मिनेटको लागि छोप्नुहोस (यसले अत्त्यधिक मात्रामा भएको पानि सोस्छ)',
        'एकछिन राम्रसि चलाउनुहोस अनि कपमा हाल्नुहोस',
        'Your MASALA CHIYA is ready. ENJOY!!'
      ]),
  RecipeStructure(
      name: 'च्याउको अचार',
      ename: 'Mushroom Pickle',
      mainItem: MainItem.vegetable,
      veg: true,
      image:
          'https://firebasestorage.googleapis.com/v0/b/food-recipes-in-nepali.appspot.com/o/Mushroom%20Pickle.jpg?alt=media&token=d9538567-8094-4cf2-a1b2-cb8baaaed1af',
      description:
          'च्याउ तरकारीमा प्रिय मानिन्छ। प्राय: तरकारीकै रुपमा खाइने च्याउलाई अचारको पुरानै विधि प्रयोग गरेर स्वादिलो भिन्न परिकार बनाउन सकिन्छ ।',
      ingredients: {
        'Mushroom': 'एक किलो डल्ले च्याउ',
        'Ginger': 'अदुवा – २०० ग्राम',
        'Sesame': 'तील – २०० ग्राम',
        'Green Chilli': 'खुर्सानी – हरियो , २०० ग्राम',
        'Mustard Oil': 'तोरी तेल – १०० ग्राम',
        'Lemon': 'कागतीको रस',
        'Spices': 'बेसार, धनियाँ पत्ता, टिमुर, मेथी र तोरी',
      },
      stepsForCooking: [
        'डल्ले च्याउलाई राम्रो सँग पानिमा धुने र दुइ सिट्टि लगाउने',
        'सेलाए पछिको च्याउलाई चप वोर्डमा सानो आकारमा टुक्रा बनाउने',
        'तोरीको तेल तताएर एक चम्चा मेथी कालो बनाएर फुराउने, एक चम्चा तोरीको दाना पड्काएर त्यसमा एक चम्चा बेसार र एक चिम्टी हिंग हाल्ने । सानो आकारमा काटेको अदुवा फुराउने',
        'लामो पारेर काटेको खुर्सानी फुराउने , छोपीदिने खुर्सानीको खार सकिन्छ अनि मात्र ढक्कन निकालेर च्याउ हालेर सानो आगोमा २० मिनट पाक्न दिने । पाकेपछि सेलाउने',
        'नून हाल्ने र तील भुटेको धुलो पनि हालेर चलाउने । अनी कागतीको रस हाल्ने । ग्रेभी बनाउन उमालेर सेलाएको पानी थप्दै चलाउने । अन्तिममा धनीयाँको पत्ता र टिमुर पनि हाल्ने । च्याउको अचार तयार भयो',
      ]),
  RecipeStructure(
    name: 'चिकेन चिल्ली',
    ename: 'Chicken Chilli',
    veg: false,
    popular: true,
    mainItem: MainItem.meat,
    image:
        'https://firebasestorage.googleapis.com/v0/b/food-recipes-in-nepali.appspot.com/o/Chicken%20Chilli.jpg?alt=media&token=e4aca93a-b0a6-4fd7-9104-312a9cdd8dfd',
    description:
        'मिर्च कुखुरा चिनियाँ विरासतको लोकप्रिय इन्डो-चिनियाँ डिश हो। भारतमा यसले विभिन्न प्रकारका सुक्खा कुखुराको परिकार समावेश गर्न सक्छ। यद्यपि मुख्य रूपमा हड्डी रहित कुखुरा यसमा प्रयोग गरिन्छ, कोही व्यक्ति हड्डी भएको मासु गर्दछन्।',
  ),
  RecipeStructure(
      name: 'समोसा',
      ename: 'Samosa',
      veg: true,
      mainItem: MainItem.vegetable,
      popular: true,
      image:
          'https://firebasestorage.googleapis.com/v0/b/food-recipes-in-nepali.appspot.com/o/Samosa.jpg?alt=media&token=07dd0dc2-fc66-4d4f-8349-c37abb5e80b6',
      description:
          'मोसा भोक र स्वाद दुवैको लागि राम्रो साथी हो । घरमा आफैले बनाएको समोसा स्वस्थबर्द्धक समेत हुन्छ ।',
      ingredients: {
        'Flour': 'मैदा-२०० ग्राम',
        'Potato': 'आलु -१/२ के.जी',
        'Green Chilli': 'हरियो खुर्सानी : २ वटा',
        'Onion': 'प्याज -१५० ग्राम',
        'green vegetables': 'तोरी वा रायो-थोरै',
        'Cashew': 'काजु: ४-५ ',
        'Raisins': 'किसमिस: ४-५',
        'coriander leaf': 'धनियाको धुलो वा गेडा',
        'Spices': 'सब्जी मसला १ चिया चम्चा',
      },
      stepsForCooking: [
        'मैदामा तेलले मोलेर नुन मिसाएको पानी अलि अलि राख्दै मुछ्ने र एउटा भाडोमा छोपेर १/२ देखि १ घण्टा राख्ने ।',
        'उसिनेको आलु मसिनो टुक्रा पार्ने, प्याज र हरियो खुर्सानी मसिनो चप गरेर काट्ने ।',
        '१ टेबल चम्चा तेल तताएर त्यसमा रायो वा तोरीको संगै धनियाको गेडा पड्काउने ।',
        'बेसार हालिसकेपछि काजु, किसमिस, नुन राखेर राम्ररी चलाउने र अन्तिममा कागतीको रस १/२ चिया चम्चा मिसाएर आगोबाट निकाल्ने पिठो राम्ररी मुछ्ने र त्यसलाई सानो सानो डल्लो बनाउने ३ १/२ को गोलाईमा बेल्ने र बिचबाट काट्ने र कोण बनाउने ।',
        'कोणभित्र आलु हालेर बन्द गर्ने ।',
        'बन्द गर्दा दुबै पट्टि पानी हालेर बन्द गर्ने ।',
        'तेलमा सुनौलो नभएसम्म मध्यम आचमा पकाउने चट्नी वा सससंग तातै सर्भ गर्ने ।',
      ]),
      RecipeStructure(name: 'चिकेन चाउमिन',
      ename:''
      )
];
