import 'recipe_structure.dart';

final List<RecipeStructure> recipeList = [
  RecipeStructure(
      ename: 'Veg Sandwich',
      name: 'भेज स्यान्डविच',
      image:
          'https://images.unsplash.com/photo-1539252554453-80ab65ce3586?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=634&q=80',
      veg: true,
      mainItem: MainItem.vegetable,
      description: 'descritption here',
      ingredients: {
        'Bread': 'ब्रेड - 2',
        'lettuce': 'सलाद- २/३ पातहरू',
        'cheese': 'चीज - १ टुक्रा',
        'tomato': 'टमाटर - १ गोल घेरामा काटियो',
        'green chilli ': 'हरियो मिर्च-गोल घेरामा काटिएको ',
        'onion': 'प्याज-केही गोल सर्कलमा काटिएको ',
        'Mayonnaise': 'मेयोनेज (वैकल्पिक)',
      },
      stepsForCooking: [
        'ब्रेडको  खैरो पक्ष काट्नुहोस्',
        'ब्रेड एक मिनेट को लागी टोस्ट गर्नुहोस',
        'ब्रेड को एक तिर मेयोनेस फैलाउनुहोस',
        'ब्रेड्मा पनीर, सलाद, प्याज, टमाटर र हरियो घण्टी मिर्च राख्नुहोस्',
        'पहिलो ब्रेड्को  माथिको अर्को ब्रेड राख्नुहोस्',
        'स्यान्डविच विकर्ण गर्नको लागि दुई टुक्रा मा काट्नुहोस्',
        'Veggie sandwich is ready to serve!',
        'चिकन स्यान्डविच बनाउनका लागि तपाईले कुखुरा प्याटीहरू थप गर्नु पर्छ (चिकन किमा बर्गर)',
      ]),
  RecipeStructure(
      name: 'खुर्सानी तिल को अचार ',
      ename: 'chilly pickel',
      ingredients: {},
      veg: true,
      image:
          'https://firebasestorage.googleapis.com/v0/b/food-recipes-in-nepali.appspot.com/o/Chilly%20Pickel.jpg?alt=media&token=70a1fa93-c2c3-497e-8900-a2d16b5d9351',
         
      stepsForCooking: [
        'हरियो खोर्सोलाई आधा भागमा काट्नुहोस् (सिधा होइन)',
        'स्टोभ खोल्नुहोस् र प्यान तताउनुहोस्',
        'यसमा तेल थप्नुहोस्, जब तेल तातो छ भने मेथीको दाना थप्नुहोस्',
        'जब यो सुनहरी खैरोमा परिवर्तन हुन्छ हरियो मिर्च जोड्नुहोस्',
        'जब ती गोल्डन खैरो बन्छन् भने तिलको पाउडर र नुन थप्नुहोस्',
        'पानी थप्नुहोस्, र सबै पानी सुक्खा सम्म पकाउनुहोस्',
        'ग्यास बन्द गर्नुहोस् र कागती जुस जोड्नुहोस् र राम्रोसँग मिक्स गर्नुहोस्',
        'तपाईंको तिल र खोर्सानीको चटनी सेवा गर्नको लागि तयार छ',
        'यो चटनी चामल, रोटी, वा च्युराको साथ उत्तम हो!',
      ]),
  RecipeStructure(
    name: 'भारतीय चिकन मद्रास करी',
    ename: 'Indian Chicken Madras Curry Recipe',
    veg: false,
    mainItem: MainItem.meat,
    image:
        'https://firebasestorage.googleapis.com/v0/b/food-recipes-in-nepali.appspot.com/o/Indian%20Chicken%20Madras%20Curry%20Recipe.jpg?alt=media&token=a4e43374-9eba-4247-b9fb-bffb0c7bd2ee',
    ingredients: {
      'chicken':
          'छालाविहीन,हड्डी रहित कुखुराको मासु काटिन्छ र सुक्खा राखिन्छ',
      'onion': '१ प्याज',
      'Garlic': '८ लहसुन ',
      'Ginger': '१  अदुवा',
      'jalapeno': '१  jalapeno',
      'Vegetable oil': '१ चम्मच वनस्पति तेल',
      'Hot spice':
          '१ चम्मच गरम मसला',
      'chilli powder': '२ चम्मच खुर्सानी ',
      'Turmeric': '१/२ चम्मच हल्दी',
      'salt': '१ चम्मच नुन',
      'tomato': '२ कप पिसेको टमाटर ',
    },
    stepsForCooking: [
      'प्याज, लसुन, अदुवा, र jalapeno एक मिनी फूड प्रोसेसर वा ब्लेन्डरमा हाल्नुहोस । मिश्रण शुद्ध नभएसम्म ब्लेन्ड गर्नुहोस्।',
      'मसलालाई एउटा सानो कटोरामा मिलाउनुहोस् र अलग राख्नुहोस्।',
      'सानो  सेटिंगमा  भाँडामा तेल तताउनुहोस्। प्याजको मिश्रण थप्नुहोस् र  ३- ४  मिनेटसम्म धेरै जसो पानीको बाफ  नभएसम्म पकाउनुहोस्',
      'प्याजको मिश्रणमा मसला र नुन थप्नुहोस् र मसलाहरू सुगन्धित नभएसम्म १ - २ मिनेटसम्म पकाउनुहोस्।',
      'कुखुराको मासु  हाल्नुहोस  र सबै पक्षहरू ब्राउन नभएसम्म लगभग ३-४  मिनेटसम्म पकाउनुहोस्।',
      'पिसेको  टमाटर थप्नुहोस् र चलाउनुहोस ',
      'तत्काल भाँडोमा ढकनी राख्नुहोस् र  ४ मिनेटको लागि प्रेसर कुक हुन दिनुस । ४ मिनेट पछि ढकनी खोल्नुहोस , एक चोटि स्टीम सकिए पछि, तत्काल भाँडो खोल्नुहोस्। यदि sauce धेरै पानी भएको छ भने, मासु  हटाउनुहोस् र गाढा नहुञ्जेल सानो  सेटिंगमा sauce पकाउनुहोस्।',
      'खानको लागि तयार भयो ',
    ],
  ),
  RecipeStructure(
      name: 'गाजर को हलुवा',
      ename: 'Carrot Halva',
      veg: true,
      mainItem: MainItem.vegetable,
      image:
          'https://firebasestorage.googleapis.com/v0/b/food-recipes-in-nepali.appspot.com/o/Carrot%20Halva.jpg?alt=media&token=24a686dd-d863-4533-b977-d9e7cee66bfc',
      description:
          'गाजरमा आधारित मीठो मिठाई पुडिंग भारतीय उपमहाद्वीपबाट आएको हो । यो पानी, दूध र चिनी को एक निश्चित मात्रा युक्त भाँडो मा धुलिएको  गाजर राखेर र त्यसपछि पकाउँदा लगातार चलाएर बनाइएको हो',
      ingredients: {
        'Carrots': '२ कप टुक्राइयेको गाजर',
        'Milk': '२ कप दुध',
        'sugar': 'चिनी १/४ कप',
        'Cardamom powder': 'इलायची पाउडर १/२ चम्माच',
        'cashew': 'काटिएको काजु-६',
        'Ghee': 'घीउ- १/२ चम्मच',
      },
      stepsForCooking: [
        'दूध उमाल्नुहोस्',
        'अर्को प्यानमा घी पगाल्नुहोस्'
            'टुक्राइयेको गाजर थप्नुहोस् र करीव सात मिनेट को लागी फ्राई गर्नुहोस्',
        'जब गाजर अलि सुनौलो खैरो परिणत हुन्छ दूध हाल्नुहोस',
        'सबै दूध सुक्खा नहुने सम्म यो मिश्रण पकाउनुहोस्',
        'चिनी र इलायची पाउडर राख्नुहोस् र राम्रोसँग मिक्स गर्नुहोस्',
        'चार मिनेट को लागी पकाउनुहोस',
        'काजूको साथ गार्निश गर्नुहोस्',
        'स्टोभ बन्द गर्नुहोस् गजर हालुवा खानको लागि तयार छ',
        'तपाईं यो हलवालाई एक ग्रीस प्लेटमा फ्रिज गर्न सक्नुहुन्छ',
        'बर्फीको आकारमा यसलाई काट्नुहोस् गजर बर्फी तयार छ',
      ]),
  RecipeStructure(
      name: 'चिकन दम बिरयानी',
      ename: 'Chicken Dum Biryani',
      image:
          'https://firebasestorage.googleapis.com/v0/b/food-recipes-in-nepali.appspot.com/o/Chicken%20Dum%20Biryani.jpg?alt=media&token=751d7e89-1efa-45b9-a0a9-8b73fb65d005',
      description:
          'सामान्य चिकन बिरयानीमा मासुलाई छुट्टिन्छ र थपिएको हुन्छ, जबकि दम बिरयानीमा सम्पूर्ण चावल, मासु, आलु वाफ र दबाबले पकाइन्छ। यसैले फ्राइड कुखुरा बिरयानी अधिक तेल र मसलादार हुनेछ, र दम बिरियानी अधिक सुगन्धित हुनेछ।',
      veg: false,
      mainItem: MainItem.meat,
      ingredients: {
        'Chicken': 'खुखुराको मासु (लेग)-५०० ग्राम',
        'chilli': '१ चम्मच रातो खोर्सानी पाउडर',
        'ginger': '२ चम्मच अदुवा-लसुन पेस्ट',
        'curd': '१/२ कप दही',
        'turmeric': '१/२ चम्मच हल्दी पाउडर',
        'coriander': '१ चम्मच धनिया पाउडर',
        'spices': '१ चम्मच गरम मसला पाउडर',
        'saffron': 'एक चुटकी केसर',
        'milk': '1/2 कप दूध',
        'cardamoms': '5 इलाइची',
        'Cinnamon': '१ दाल​चीनी स्टिक ',
        'rice': 'बासमती चावल',
        'Onion': 'प्याज',
      },
      stepsForCooking: [
        'एक कप दुधमा केसर मिलाउनुहोस् र यसलाई छेउमा राख्नुहोस्।',
        'अब चामल तयार गर्नको लागि, केसरलाई खारेज गर्नुहोस् र सामग्रीहरू धोईएको भातमा राख्नुहोस्।',
        'यसलाई १० देखि १5 मिनेट सम्म पकाउनुहोस्।',
        'प्यानमा घी तताउनुहोस् र मरीनेट गरिएको कुखुरा र पकाइएको चामल पनि थप्नुहोस्। केसरको दूध, धनिया, भुटेको प्याज र काटिएको बदाम जोड्नुहोस् र राम्रोसँग मिक्स गर्नुहोस्।',
        'यसलाई कम तातोमा पाक्न दिनुहोस् र २० देखि ३० मिनेटसम्म  छोप्नुहोस्। (पानी सुकाउँदै, कुखुरा र चामल पूर्ण रूपमा पाकुन्जेल सम्म यसलाई छोड्नुहोस ।)',
        'अब यसलाई खोल्नुहोस् र चामल राम्ररी मिलाउनुहोस्। तपाईं यसलाई केही गुलाब पानी थपेर खान सक्नुहुन्छ।',
        'एउटा भाडोमा कुखुराको मासु राखी म्यारिनेट गर्ने मसला राखी २/3 घण्टाको लागि छोड्नुहोस ',
        'NOTE: बिरयानी बनाउने क्रममा, ध्यान दिनुहोस् कि चामल न टुक्रियोस'
      ])
];
