import 'recipe_structure.dart';

class RecipeList {
  List<RecipeStructure> recipeList = [
     RecipeStructure(foodTitle: 'Veg Sandwich',ingredients: [
      'ब्रेड - 2',
      'सलाद - २ देखि ३ पातहरू',
      'चीज - १ टुक्रा',
      'टमाटर - १ गोल ​​गोल घेरामा काटियो',
      'हरियो घाउ मिर्च - केही राम्रो गोल घेरामा काटिएको ',
      'प्याज- केही गोल गोल सर्कलमा काटिएको ',
      'मेयोनेज- (वैकल्पिक)',
    ], stepsForCooking: [
      'ब्रेडको  खैरो पक्ष काट्नुहोस्',
      'ब्रेड एक मिनेट को लागी टोस्ट गर्नुहोस',
      'ब्रेड को एक तिर मेयोनेस फैलाउनुहोस',
      'ब्रेड्मा पनीर, सलाद, प्याज, टमाटर र हरियो घण्टी मिर्च राख्नुहोस्',
      'पहिलो ब्रेड्को  माथिको अर्को ब्रेड राख्नुहोस्',
      'स्यान्डविच विकर्ण गर्नको लागि दुई टुक्रा मा काट्नुहोस्',
      'Veggie sandwich is ready to serve!',
      'चिकन स्यान्डविच बनाउनका लागि तपाईले कुखुरा प्याटीहरू थप गर्नु पर्छ (चिकन किमा बर्गर)',
    ])
  ];
}
